# IfcProjectGuid Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..IfcProjectGuid Property
ParameterTypeId Class See Also
---
"IfcProject GUID"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId IfcProjectGuid { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property IfcProjectGuid As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ IfcProjectGuid {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace